Better README.md for anyone trying to copy this config.  (#6)
* Testing a new Readme that's user friendly

* Updating the chart

* Updating the readme some more

* Updating nixos config

* Again

* again

* Testing the min example
